Revit 2015 API
FormatOptions.UseGrouping Property
 Indicates if digit grouping symbols should be displayed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2015.  Use the UseDigitGrouping property instead.")]
public bool UseGrouping { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2015.  Use the UseDigitGrouping property instead.")> _
Public Property UseGrouping As Boolean
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2015.  Use the UseDigitGrouping property instead.")]
public:
property bool UseGrouping {
	bool get ();
	void set (bool value);
}
Field Value
 True if digit grouping symbols should be displayed, false otherwise. The default is false.
Remarks
 This property is equivalent to the UseDigitGrouping property. See that property for details.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace